cask_args appdir: "~/Applications", fontdir: "~/Library/Fonts"

tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"
tap "d12frosted/emacs-plus"

# cli
brew "mas"
brew "hub"
brew "wifi-password"
brew "youtube-dl"
brew "httrack"
brew "duti"
cask "ngrok"

# code tools
brew "git"
brew "zsh"
brew "grep"
brew "ag"
brew "moreutils"
brew "jq"
brew "tree"
brew "pstree"
brew "wget"
brew "wrk"
brew "git-hooks"
cask "meld"

# image optimization
# brew "guetzli"
brew "giflossy"
brew "ffmpeg"
brew "base64"
brew "svgo"
cask "imageoptim"
cask "handbrake"

# bash
brew "bash"
brew "bash-completion@2"

# bash linters
brew "shellcheck"
brew "checkbashisms"

# asdf requirements
brew "coreutils"
brew "gpg"

# coding
brew "exercism"
cask "visual-studio-code"
cask "hyper"
brew "emacs-plus", args: ["HEAD", "with-24bit-color"], restart_service: true

# languages
brew "asdf"
brew "yarn", args: ["without-node"]
brew "go"

# browsers
cask "google-chrome"
cask "firefox-developer-edition"

# others
cask "daisydisk"
cask "skype"

# fun
cask "vlc"
cask "transmission"

# fonts
# https://github.com/Homebrew/homebrew-bundle/issues/291#issuecomment-333902433
cask "caskroom/fonts/font-fira-code"

# static site
brew "hugo"